In [37]:
import pandas as pd 
from pathlib import Path
import os

In [38]:
pwd = os.getcwd()
filepath = pwd + "\\raw_data\\Data - IT_Companies_Algiers_Raw.csv"
filepath

'g:\\CodeCodeCode\\Data Analyse\\Algerian IT Companies - Clean Version\\Ouedkniss\\raw_data\\Data - IT_Companies_Algiers_Raw.csv'

In [39]:
# This reads the csv into Python
df = pd.read_csv(
    filepath, usecols=['company_id', 'company_name', 'city'])
it_companies = df.copy()

In [40]:
it_companies.shape

(24000, 3)

In [41]:
it_companies['company_id'].duplicated().sum()

23589

In [42]:
it_companies.drop_duplicates(keep='first', subset=(['company_id']), inplace=True)
it_companies

       company_id                 company_name             city
0           13556                    Arcontech     Dar el beida
2           13228                    Eleceurop            Kouba
3           13806                  NGT MEZIANI  Bordj el kiffan
4            9873         Novoreka ERP Algérie        Blida - 9
5           14338                   VAST SOFT         Bouzareah
...           ...                          ...              ...
23411       13310                  Sarl GEOXAL      Dely brahim
23417       16435  Horizon Biskra informatique       Biskra - 7
23445       15664                 Solution4all      Hussein dey
23615        4001                         Smog            Hydra
23703        8464          APOINT Flamme Bleue       Belouizdad

[411 rows x 3 columns]

In [43]:
it_companies.sort_values(by='company_id', inplace=True, ignore_index=True)
it_companies

     company_id                         company_name             city
0           115                          ELEGANT PC       Bab ezzouar
1           248                              AlgerPC            Hydra
2           273                     Tassili computer     Dar el beida
3           281                   Dream Sat   Kouba             Kouba
4           290                              DyalKom            Kouba
..          ...                                  ...              ...
406       16458                       Anelectronique      Bab ezzouar
407       16462                Class Bifrost Consult        El achour
408       16475                          Eurl Ecopos           Draria
409       16549                Computer El Yassamine  Bordj el kiffan
410       16552  Source technologie informatique STI            Kouba

[411 rows x 3 columns]

In [44]:
Path(pwd + '\\dataframes').mkdir(parents=True, exist_ok=True)
it_companies.to_csv(pwd + "\\dataframes\\Data - IT_Companies_Algiers.csv")